In [25]:
import pandas as pd

In [26]:
df =pd.read_csv(r"D:\VIIT SEM 3\AI BootCamp\Assignment 1\Assignment 1\Students.csv")
df.head()

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         175
1          2      Bob    Male   16        NaN          95.0          95
2          3  Charlie    Male   15       80.0           NaN          80
3          4    Diana  Female   16       90.0          85.0         175
4          5      Eve  Female   15       75.0          70.0         145

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   StudentID     5 non-null      int64
 1   Name          5 non-null      object
 2   Gender        5 non-null      object
 3   Age           5 non-null      int64
 4   MathScore     4 non-null      float64
 5   EnglishScore  4 non-null      float64
 6   TotalScore    5 non-null      int64
dtypes: float64(2), int64(3), object(2)
memory usage: 412.0+ bytes

In [27]:
df['MathScore'] = df['MathScore'].fillna(df['MathScore'].mean())

In [30]:
df['EnglishScore'] = df['EnglishScore'].fillna(df['EnglishScore'].mean())

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   StudentID     5 non-null      int64
 1   Name          5 non-null      object
 2   Gender        5 non-null      object
 3   Age           5 non-null      int64
 4   MathScore     5 non-null      float64
 5   EnglishScore  5 non-null      float64
 6   TotalScore    5 non-null      int64
dtypes: float64(2), int64(3), object(2)
memory usage: 412.0+ bytes

In [35]:
df_encoded = pd.get_dummies(df['Gender'], drop_first=True)

In [32]:
english_scores = df['EnglishScore']
math_scores = df['MathScore']
df['TotalScore'] = english_scores + math_scores

In [36]:
print(df)

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0       175.0
1          2      Bob    Male   16       82.5          95.0       177.5
2          3  Charlie    Male   15       80.0          85.0       165.0
3          4    Diana  Female   16       90.0          85.0       175.0
4          5      Eve  Female   15       75.0          70.0       145.0

In [34]:
df.head()

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0       175.0
1          2      Bob    Male   16       82.5          95.0       177.5
2          3  Charlie    Male   15       80.0          85.0       165.0
3          4    Diana  Female   16       90.0          85.0       175.0
4          5      Eve  Female   15       75.0          70.0       145.0

In [37]:
df_gender = pd.get_dummies(df['Gender'], prefix='', prefix_sep='')
df = pd.concat([df, df_gender], axis=1)

In [38]:
df.drop('Gender', axis=1, inplace=True)

print(df)

   StudentID     Name  Age  MathScore  EnglishScore  TotalScore  Female   Male
0          1    Alice   15       85.0          90.0       175.0    True  False
1          2      Bob   16       82.5          95.0       177.5   False   True
2          3  Charlie   15       80.0          85.0       165.0   False   True
3          4    Diana   16       90.0          85.0       175.0    True  False
4          5      Eve   15       75.0          70.0       145.0    True  False

In [41]:
df["Female"] = df["Female"].astype(int)

In [42]:
df["Male"] = df["Male"].astype(int)

print(df)

In [43]:
print(df)

   StudentID     Name  Age  MathScore  EnglishScore  TotalScore  Female  Male
0          1    Alice   15       85.0          90.0       175.0       1     0
1          2      Bob   16       82.5          95.0       177.5       0     1
2          3  Charlie   15       80.0          85.0       165.0       0     1
3          4    Diana   16       90.0          85.0       175.0       1     0
4          5      Eve   15       75.0          70.0       145.0       1     0

In [44]:
from scipy.stats import zscore

df[["MathScore","EnglishScore","TotalScore"]] = df[["MathScore","EnglishScore","TotalScore"]].apply(zscore)

In [45]:
print(df)

   StudentID     Name  Age  MathScore  EnglishScore  TotalScore  Female  Male
0          1    Alice   15        0.5      0.597614    0.622841       1     0
1          2      Bob   16        0.0      1.195229    0.830455       0     1
2          3  Charlie   15       -0.5      0.000000   -0.207614       0     1
3          4    Diana   16        1.5      0.000000    0.622841       1     0
4          5      Eve   15       -1.5     -1.792843   -1.868523       1     0